{
    "onInit": {
        "langTitle": "Elije tu idioma",
        "langText": "Lo puedes cambiar después en el menú de la esquina superior derecha.",
        "langEN": "Inglés",
        "langES": "Español"
    },
    "asidebar": {
        "socialNetworks": "Mis redes sociales",
        "contact": "Contacto",
        "contactText": "¡Mándame un mensaje y me pondré en contacto contigo lo más pronto posible!",
        "namePlaceHolder": "Tu nombre o empresa",
        "nameError": "Nombre no válido.",
        "emailPlaceHolder": "Tu email",
        "emailError": "Email no válido.",
        "subjectPlaceHolder": "Asunto",
        "subjectError": "Asunto no válido.",
        "subjectPrepend": "A",
        "messagePlaceHolder": "Mensaje",
        "messageError": "Mensaje no válido.",
        "sendMessage": "Mandar Mensaje",
        "messageAlertTitle": "¡Éxito!",
        "messageAlertText": "Mensaje enviado correctamente",
        "settings": "Configuración",
        "language": "Idioma"
    },
    "footer": {
        "message": "Con amor desde"
    },
    "home": {
        "aboutMeHeader": "Sobre mí",
        "aboutMeTitle": "¿Quién soy yo?",
        "aboutMeText": "Mi nombre es Jorge García, soy un estudiante de Ingeniería de Software que le apasiona hacer la vida de las personas mejor mediante el software. Mi conjunto de habilidades actuales me hacen estar enfocado principalmente en desarrollo Full Stack pero siempre estoy aprendiendo cosas nuevas.",
        "cvTitle": "Mi resume",
        "cvText": "liga",
        "projectsHeader": "Algunos de mis proyectos",
        "pTitle": "Resumen del proyecto",
        "live": "Proyecto en vivo",
        "noLive": "Proyecto en vivo no disponible",
        "code": "Código Fuente",
        "tech": "Tecnologias usadas",
        "role": "Mi rol",
        "difficulties": "Mis dificultades",
        "solutions": "Mi solución",
        "notableFeatures": "Funciones notables",
        "p1Header": "Plataforma administrativa para guardería",
        "p1Text": "Su enfoque principal es el llenado de reportes diarios de cada niño que deben de realizar su maestro y su padre, también permite seguir el desarrollo del menor con estándares de la Asociación Mexicana de Pediatría. El administrador puede mandejar información de los maestros, grupos, información de los menores y mandar mensajes a los padres.",
        "p1Note": "Nota: Este proyecto está siendo usado actualmente por una institución, por lo que no podrás iniciar sesión.",
        "p1Role": "Todo el proyecto fue hecho por mí, desde diseñar la interfaz de usuario, la arquitectura del sistema, y la base de datos relacional, a tener juntas regulares con el cliente para discutir sus requerimientos y el desarrollo de mi proyecto. Trabajé con la metodología SCRUM con sprints de dos semanas, al final de cada sprint tuve una junta con el cliente para explicar mi progreso.",
        "p1Difficulties": "La plataforma fue diseñada para varios tipos de usuarios, incluyendo maestros, padres y administradores, pero ninguno de ellos es adepto a la tecnología, esto significa que en veces se les dificultaba realizar tareas básicas de computación, esto fue especialmente difícil con los padres de familia, ya que algunos no tenían correo electrónico, smartphones o computadora en su casa.",
        "p1Solutions": "La solución tuvo varias implicaciones, desde modificaciones pequeñas a la interfaz de usuario, crear una guía en PDF para los padres de familia, hasta poner una tablet en la entrada para que los padres que no tuvieran un smartphone o una computadora también pudieran usar la plataforma.",
        "p1NF1": "Login y registro con email.",
        "p1NF2": "Mandar un código único para registro seguro.",
        "p1NF3": "Llenado y vista de reportes diarios.",
        "p1NF4": "Administración de información de maestros, padres y menores.",
        "p1NF5": "Supervisión del desarrollo de cada menor basado en estándares pediátricos.",
        "p2Header": "Aplicación de navegación dentro de universidad",
        "p2Text": "La aplicación permitía a visitantes dentro de la universidad buscar la ubicación de profesores, personal administrativo y lugares importantes, tomando en cuenta la ubicación en tiempo real de los visitantes y guiándolos con Google Maps.",
        "p2Note": "",
        "p2Role": "Dos compañeros y yo desarrollamos esta aplicación, mi rol fue ser el líder del equipo, diseñar la interfaz de usuario, una parte de la arquitectura, y desarrollar la mayoría de las funciones. Trabajamos con la metodología SCRUM con sprints de dos semanas, al final de cada sprint teníamos una junta con el cliente para mostrar nuestros resultados y obtener su aprovación.",
        "p2Difficulties": "Necesitábamos tener actualizadas las ubicaciones de cada maestro en el edificio de maestros, pero la universidad no tenía esos registros en su base de datos, y esta información era crucial para el éxito del proyecto.",
        "p2Solutions": "Un miembro del equipo se fue puerta por puerta registrando manualmente puerta por puerta cada ubicación, apoyado de un mapa del edificio que le hice. Después organizamos esa información para crear las rutas donde le explicamos al visitante como llegar exactamente a la oficina de cada maestro.",
        "p2NF1": "Login y registro con email y Facebook.",
        "p2NF2": "Ubicación de tiempo real con Google Maps.",
        "p2NF3": "Búsqueda en bases de datos nosql con diferentes parámetros de búsqueda.",
        "p2NF4": "Animaciones de carga.",
        "p2NF5": "Uso de Firebase Storage para hostear todas las imágenes.",
        "p3Header": "Aplicación para recuperación de adicciones",
        "p3Text": "Esta aplicación permite a los usuarios tener control sobre sus adicciones mediante ejercicios terapéuticos y un registro de su avance en un calendario.",
        "p3Note": "",
        "p3Role": "Todo el proyecto fue realizado por mi con supervisión de una psicóloga experta en recuperación de adicciones. La psicóloga se aseguró que los ejercicios en la aplicación estuvieran basados en ciencia mientras yo trabajaba en hacerlos realidad.",
        "p3Difficulties": "Al inicio del proyecto tenía ciertos ejercicios en mente para la aplicación, pero después de mi primera junta con la psicóloga, tuve que investigar algo de teoría sobre los métodos terapéuticos para aplicarlos a la aplicación, porque mis ejercicios propuestos no eran adecuados para recuperación de adicciones.",
        "p3Solutions": "Después de que investigué los ejercicios adecuados para la recuperación de adicciones, la psicóloga me ayudó a elegir los que más impacto tendrían, y al final nos quedamos con seis.",
        "p3NF1": "Login y registro con email, Facebook y Google.",
        "p3NF2": "Seis ejercicios terapéuticos.",
        "p3NF3": "Registro del avance y estado de ánimo de cada día.",
        "p3NF4": "Calendario que muestra el estado de ánimo de cada día y si fue un día limpio o se recayó.",
        "p3NF5": "Uso de base de datos nosql para guardar la información de cada usuario."
    },
    "blog": {

    },
    "braintegral": {
        "brainHeader": "La plataforma definitiva para la recuperación de adicciones viene pronto.",
        "brainTitle": "¿Qué es Braintegral?",
        "brainDescription": "Braintegral es una plataforma para ayudar a las personas a recuperarse de sus adicciones.",
        "brainFooter": "Únete a la lista de espera para recibir actualizaciones sobre el futuro lanzamiento.",
        "emailPlaceHolder": "Tu email",
        "emailError": "Email no válido.",
        "sendMessage": "Únete",
        "modalTitle": "¡Gracias!",
        "modalText": "Serás informado sobre futuros avances del proyecto."
    }
}